Dlubal.RFEM5.IView
Interface for working with view

Dlubal.RFEM5.IView.PickObjects(System.UInt32,System.String@)
Start selection tool to select specified objects.
Tool: Type of selection tool
Objects: List of selected objects numbers

Dlubal.RFEM5.IView.CopyGraphicsToClipboard
Copy graphics to clipboard.

Dlubal.RFEM5.IView.CleanClipboard
Empty clipboard.

Dlubal.RFEM5.IView.GetViewPoint
Gets view point.
Returns: View point parameters

Dlubal.RFEM5.IView.SetViewPoint(System.UInt32@)
Sets viewpoint.
ViewPoint: Viewpoint parameters

Dlubal.RFEM5.IView.SelectLoading(System.UInt32,System.Int32)
Selects loading.
Type: Loading type
No: Loading number

Dlubal.RFEM5.IView.ShowLoads(System.Boolean,System.Boolean)
Shows loads.
ShowLoads: Show / hide loads
ShowValues: Show / hide load values

Dlubal.RFEM5.IView.ShowPerspective(System.Boolean)
Shows perspective.
Show: Show / hide perspective

Dlubal.RFEM5.IView.ShowAll
Shows All.